```
└─> ./run.sh apply                                                                                                                                                                                                                                                                                                   
                                                                                                                                                                                                                                                                                                                     
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:                                                                                                                                                                           
  + create                                                                                                                                                                                                                                                                                                           
                                                                                                                                                                                                                                                                                                                     
Terraform will perform the following actions:                                                                                                                                                                                                                                                                        
                                                                                                                                                                                                                                                                                                                     
  # cloudfoundry_service_instance.shared_config_bucket will be created                                                                                                                                                                                                                                               
  + resource "cloudfoundry_service_instance" "shared_config_bucket" {                                                                                                                                                                                                                                                
      + id               = (known after apply)                                                                                                                                                                                                                                                                       
      + name             = "ct-shared-config"                                                                                                                                                                                                                                                                        
      + recursive_delete = false                                                                                                                                                                                                                                                                                     
      + service_plan     = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806"                                                                                                                                                                                                                                                    
      + space            = "e85b8a7b-ce38-447d-91de-09f64ef87380"                                                                                                                                                                                                                                                    
    }                                                                                                                                                                                                                                                                                                                
                                                                                                                                                                                                                                                                                                                     
  # cloudfoundry_service_key.config_bucket_creds will be created                                                                                                                                                                                                                                                     
  + resource "cloudfoundry_service_key" "config_bucket_creds" {                                                                                                                                                                                                                                                      
      + credentials      = (known after apply)                                                                                                                                                                                                                                                                       
      + id               = (known after apply)                                                                                                                                                                                                                                                                       
      + name             = "config-bucket-access"
      + service_instance = (known after apply)
    }                                                                        

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:                                                          
  + bucket_credentials = (known after apply)

Do you want to perform these actions?                                        
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes                                                         

cloudfoundry_service_instance.shared_config_bucket: Creating...
cloudfoundry_service_instance.shared_config_bucket: Creation complete after 7s [id=804abf2a-8993-4201-9ede-3b4da2b1babf]
cloudfoundry_service_key.config_bucket_creds: Creating...
cloudfoundry_service_key.config_bucket_creds: Creation complete after 0s [id=1205fa53-d63f-4ea7-a229-0b9e1ccc9bd7]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```